import { createStore } from "redux";
import todoApp from "./reducers/reducers";

/* Дүкөн - бул бөлүктөрдү бириктирүүчү объект. Дүкөн төмөнкү милдеттерди аткарат:

өтүнмөнүн абалын камтыйт;
getState () аркылуу мамлекетке кирүүнү камсыз кылат;
диспетчерлик (аракет) аркылуу абалды жаңыртуу мүмкүнчүлүгүн камсыз кылат;
Жазылуу (угуучу) тарабынан кайтарылган функцияны колдонуп, каттоодон чыгарылган угуучуларды иштетет.


Белгилей кетчү нерсе, Redux тиркемесинде бир гана дүкөнүңүз болот. E
Эгерде сиз маалыматтарды иштетүү логикасын бөлгүңүз келсе, анда редуктордун курамын колдонууңуз керек болот
бир нече дүкөндөрдү колдонуунун ордуна.

Эгер редукторуңуз болсо, Дүкөндү түзүү абдан оңой.
Биз бир нече редукторду бир глобалдык редукторго бириктирүү үчүн CombineReducers () колдондук.
Эми биз аларды импорттоп, createStore () өткөрүп беребиз.
 */

export let store = createStore(todoApp); /* chakyrylat createStore ititilation bolot */